# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@8.1'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'pnpm'

# Apps
cask '1password'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'github'
cask 'insomnia'
cask 'phpmon'
cask 'readdle-spark'
cask 'slack'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'notion'
cask 'setapp'

# Mac App Store
mas 'Things', id: 904280696
mas 'GoodNotes 5', id: 1444383602
mas 'Notability', id: 360593530
